/*REXX*/
PARSE ARG COPYBOOK PKGNUM
IF COPYBOOK = ' ' THEN
DO
  ADDRESS ISPEXEC
  /* GET CURSOR POS ON CURRENT SCREEN */
  /* ZSCREENI = ENTIRE TEXT ON CURRENT SCREEN */
  /* ZSCREENC = CURRENT POS OF CURSOR WRT CURRENT SCREEN */
  "VGET (ZSCREENI ZSCREENC)"
  CURSOR = ZSCREENC + 1

  /* IF TEXT AT CURRENT POS IS SPACE THEN DISPLAY ERROR */
  IF SUBSTR(ZSCREENI,CURSOR,1) = ' ' THEN
    CALL EXIT8 'CURSOR POS NOT ON COPYBOOK NAME'
  ELSE
  DO
    DO UNTIL SUBSTR(ZSCREENI,CURSOR,1) = ' ' | CURSOR = 1
      CURSOR = CURSOR - 1
    END
  END

  /* GET VALUE OF WORD AT CURSOR POS TO BE USED AS COPYBOOK NAME */
  CURSOR = CURSOR + 1
  FLD_LEN = POS(' ',ZSCREENI,CURSOR) - CURSOR
  COPYBOOK = SUBSTR(ZSCREENI,CURSOR,FLD_LEN)

  /* CHECK IF COPYBOOK NAME HAS VALID CHARS */
  X = 1
  ST = 1
  STPOS = 0
  IF DATATYPE(COPYBOOK,'A') <> 1 THEN
  DO UNTIL X <> 1
    X = DATATYPE(SUBSTR(COPYBOOK,ST,1),'A')
    IF X=1 THEN 
    DO
      ST = ST + 1
      IF STPOS = 0 THEN 
        STPOS = ST - 1
    END
    ELSE IF SUBSTR(COPYBOOK,ST,1) = ' ' THEN LEAVE
    ELSE IF STPOS > 0 THEN LEAVE
    ELSE
    DO
      ST = ST + 1
      X = 1
    END
  END

  COPYBOOK = SUBSTR(COPYBOOK,STPOS,ST-1)
  IF LENGTH(COPYBOOK) > 8 THEN
    CALL EXIT8 'CURSOR NOT ON COPYBOOK NAME'
END

DSN = 'PWC.CMN.COPYLIB'
IF PKGNUM <> ' ' THEN
DO
  PKGAPP = SUBSTR(PKGNUM,1,4)
  PKGNUM = SUBSTR(PKGNUM,5,6)
  DSN = 'LIB.' || PKGAPP || '.DX.#' || PKGNUM || '.ST.CPY'
END

ADDRESS ISPEXEC
IF SYSDSN("'"DSN"("COPYBOOK")'") = 'OK' THEN
DO
  CALL OPEN_PDS
  IF RC <> 0 THEN
    CALL EXIT8 'ERROR OPENING PDS' DSN ' ; RC=' RC
  ADDRESS ISPEXEC
  "LMMFIND DATAID("DATA") MEMBER("COPYBOOK")"
  IF RC <> 0 THEN
    CALL EXIT8 'NO COPYBOOK FOUND ' COPYBOOK
  CALL VIEW_MEMBER
END
ELSE CALL EXIT8 'NO COPYBOOK FOUND' COPYBOOK

OPEN_PDS:
  ADDRESS ISPEXEC
  "LMINIT DATAID("DATA") DATASET('"DSN"') ENQ(SHR)"
  IF RC <> 0  THEN 
    CALL EXIT8 'ERROR INIT PDS '  DSN ' ;RC=' RC
  ADDRESS ISPEXEC
  "LMOPEN DATAID("DATA") OPTION (INPUT)"

VIEW_MEMBER:
  ADDRESS ISPEXEC
  "VIEW DATAID("DATA") MEMBER("COPYBOOK")"
  IF RC <> 0 THEN 
    CALL EXIT8 'ERROR VIEWING MEMBER ' COPYBOOK ' ;RC=' RC
  "LMCLOSE DATAID("DATA")"
  "LMFREE DATAID("DATA")"

EXIT8:
  ARG ERRMSG
  ZEDLMSG = ERRMSG
  ADDRESS ISPEXEC "SETMSG MSG(ISRZ001)"
  EXIT 08

/**/
